import React, { useContext } from 'react';
import { styled } from 'styled-components';
import SearchContext from '../store/search-context';
import { useNavigate } from 'react-router-dom';

const MainDiv = styled.div`
  margin: 15px;
  text-align: center;
`;

const Main = () => {

  const ctx = useContext(SearchContext);
  const navigate = useNavigate();

  const chooseSigun = (e) => {
    ctx.sigun = e.target.title;
    navigate(`/search`);
  };

  return (
    <MainDiv>
      <h3>우리 동네에 어떤 보육 시설이 있는지</h3>
      <h3>찾아볼까요?</h3>

      <img src="resources/지도_서울.jpg" useMap="#image-map" />
      <map name="image-map">
        <area
          target="_self"
          alt="강서구"
          title="강서구"
          onClick={chooseSigun}
          coords="206,293,201,310,206,342,186,361,190,386,163,405,151,435,137,440,151,470,190,484,200,504,223,487,255,487,260,474,277,475,297,513,319,523,340,514,353,497,353,470,387,470,348,420,329,388,296,374,265,332"
          shape="poly"
        />
        <area
          target="_self"
          alt="양천구"
          title="양천구"
          onClick={chooseSigun}
          coords="255,489,265,514,259,555,255,577,272,578,284,592,303,593,335,568,343,593,372,590,385,572,385,531,404,513,404,501,385,467,355,470,353,501,331,519,294,514,279,474,262,472"
          shape="poly"
        />
        <area
          target="_self"
          alt="구로구"
          title="구로구"
          onClick={chooseSigun}
          coords="254,581,254,608,239,628,256,657,237,701,314,699,333,664,343,640,365,652,364,665,401,665,414,652,412,621,402,584,380,573,370,593,343,594,333,573,303,591,274,581,264,583"
          shape="poly"
        />
        <area
          target="_self"
          alt="금천구"
          title="금천구"
          onClick={chooseSigun}
          coords="365,668,386,727,400,742,413,808,454,810,469,779,476,772,467,757,452,732,451,678,440,663,415,654,399,668"
          shape="poly"
        />
        <area
          target="_self"
          alt="영등포구"
          title="영등포구"
          onClick={chooseSigun}
          coords="385,462,471,507,479,546,501,560,485,582,481,615,471,629,444,641,439,657,415,649,409,607,404,583,383,573,387,533,405,502"
          shape="poly"
        />
        <area
          target="_self"
          alt="동작구"
          title="동작구"
          onClick={chooseSigun}
          coords="441,657,441,636,478,624,478,592,500,558,545,560,576,587,591,592,599,605,609,607,618,622,616,679,609,690,586,691,562,647,530,632,490,636,474,647"
          shape="poly"
        />
        <area
          target="_self"
          alt="관악구"
          title="관악구"
          onClick={chooseSigun}
          coords="441,660,453,682,455,736,462,757,475,757,472,773,497,790,495,802,548,812,591,785,634,740,613,691,588,694,568,676,563,642,532,639,484,635"
          shape="poly"
        />
        <area
          target="_self"
          alt="서초구"
          title="서초구"
          onClick={chooseSigun}
          coords="588,596,606,609,618,626,611,690,628,742,643,737,653,759,665,758,694,736,718,737,718,759,719,798,738,818,771,830,790,835,800,813,834,800,837,786,849,764,862,756,844,736,837,712,805,707,771,725,741,674,712,657,712,617,702,593,675,546,626,592,609,595"
          shape="poly"
        />
        <area
          target="_self"
          alt="강남구"
          title="강남구"
          onClick={chooseSigun}
          coords="677,541,717,521,742,523,768,538,803,556,806,595,817,617,859,634,882,642,887,652,899,666,906,688,931,730,909,738,896,752,871,754,849,730,838,705,806,705,796,720,764,722,751,674,714,656,704,595"
          shape="poly"
        />
        <area
          target="_self"
          alt="송파구"
          title="송파구"
          onClick={chooseSigun}
          coords="804,559,803,600,823,617,875,635,880,650,901,664,902,688,927,728,944,708,966,703,960,686,981,677,992,644,1010,627,997,622,966,608,961,595,965,568,951,554,934,553,926,532,926,516,922,487,906,482,889,514,867,541,847,548"
          shape="poly"
        />
        <area
          target="_self"
          alt="강동구"
          title="강동구"
          onClick={chooseSigun}
          coords="913,478,923,442,960,420,989,415,1026,400,1039,388,1044,410,1060,417,1058,429,1056,449,1061,476,1056,493,1014,505,994,510,990,532,975,564,953,555,937,552,925,522,926,489,926,496"
          shape="poly"
        />
        <area
          target="_self"
          alt="마포구"
          title="마포구"
          onClick={chooseSigun}
          coords="338,373,351,357,380,354,395,332,409,344,436,368,473,396,512,433,557,435,567,433,574,459,564,487,535,523,412,464,358,410"
          shape="poly"
        />
        <area
          target="_self"
          alt="용산구"
          title="용산구"
          onClick={chooseSigun}
          coords="532,524,574,457,631,460,638,470,663,469,680,479,688,511,633,563,603,580,574,573"
          shape="poly"
        />
        <area
          target="_self"
          alt="중구"
          title="중구"
          onClick={chooseSigun}
          coords="567,432,576,455,629,459,643,470,665,464,680,477,690,455,710,433,709,405,658,406,629,415,621,403,581,413"
          shape="poly"
        />
        <area
          target="_self"
          alt="성동구"
          title="성동구"
          onClick={chooseSigun}
          coords="680,475,685,506,739,502,785,528,790,497,815,469,813,437,769,421,761,406,737,403,727,413,714,406,709,435"
          shape="poly"
        />
        <area
          target="_self"
          alt="광진구"
          title="광진구"
          onClick={chooseSigun}
          coords="785,527,790,495,810,463,814,435,829,404,857,401,884,394,871,418,881,435,901,445,891,477,876,514,852,536,809,539"
          shape="poly"
        />
        <area
          target="_self"
          alt="중랑구"
          title="중랑구"
          onClick={chooseSigun}
          coords="829,401,820,273,849,261,898,255,913,260,925,288,908,305,915,334,903,361,889,381,886,398,849,405"
          shape="poly"
        />
        <area
          target="_self"
          alt="동대문구"
          title="동대문구"
          onClick={chooseSigun}
          coords="818,300,828,404,817,436,766,421,763,404,737,401,729,413,710,403,709,381,717,371,721,355,756,342,771,315"
          shape="poly"
        />
        <area
          target="_self"
          alt="성북구"
          title="성북구"
          onClick={chooseSigun}
          coords="822,276,793,266,773,241,763,255,754,275,709,283,692,276,682,243,663,223,641,207,621,199,611,209,618,229,633,298,618,317,621,327,658,339,680,383,710,384,722,354,758,341,768,314,817,300"
          shape="poly"
        />
        <area
          target="_self"
          alt="종로구"
          title="종로구"
          onClick={chooseSigun}
          coords="577,213,603,213,613,226,635,292,621,316,616,326,655,341,678,385,710,388,712,405,640,415,621,402,582,415,562,395,574,346,564,321,555,309,555,245"
          shape="poly"
        />
        <area
          target="_self"
          alt="서대문구"
          title="서대문구"
          onClick={chooseSigun}
          coords="554,293,532,309,525,324,506,325,501,341,463,349,447,368,451,384,503,435,560,440,586,413,564,393,574,346,567,317,554,317"
          shape="poly"
        />
        <area
          target="_self"
          alt="은평구"
          title="은평구"
          onClick={chooseSigun}
          coords="400,334,444,373,466,344,500,347,506,327,530,315,552,295,555,246,577,207,586,174,542,133,532,135,527,152,500,158,496,169,466,165,459,202,451,244,444,276,446,305,431,332"
          shape="poly"
        />
        <area
          target="_self"
          alt="강북구"
          title="강북구"
          onClick={chooseSigun}
          coords="624,194,623,123,648,67,678,56,688,79,683,101,683,142,709,165,729,180,758,216,773,243,754,271,724,282,695,275,678,238,635,212"
          shape="poly"
        />
        <area
          target="_self"
          alt="도봉구"
          title="도봉구"
          onClick={chooseSigun}
          coords="678,53,683,22,736,15,734,36,762,39,777,46,788,42,786,68,776,98,777,122,784,142,784,171,781,196,774,223,762,219,717,169,702,164,681,142,685,83"
          shape="poly"
        />
        <area
          target="_self"
          alt="노원구"
          title="노원구"
          onClick={chooseSigun}
          coords="785,39,813,30,825,13,850,34,881,39,872,76,886,111,869,142,872,164,906,177,916,216,908,229,894,236,897,250,854,260,820,273,796,268,763,221,778,214,788,140,776,110"
          shape="poly"
        />
      </map>
    </MainDiv>
  );
};

export default Main;
